// фрагментные шейдеры не имеют точности по умолчанию, поэтому нам необходимо её
// указать. mediump подойдёт для большинства случаев. Он означает "средняя точность"
precision mediump float;

// раньше использовалась для установки фиксированного цвета для каждого пиксля рисуемого примитива (каждый пиксель точки / линии / треугольника)
uniform vec4 u_rectangleColor;

varying vec4 v_color;

void main() {
  // gl_FragColor - специальная переменная фрагментного шейдера.
  // Она отвечает за установку цвета.
  // gl_FragColor = u_rectangleColor;
  gl_FragColor = v_color;
}

// vec4(1, 0, 0.5, 1); // вернёт красновато-фиолетовый